{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.7.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 550], "dtype": "float32", "sparse": false, "ragged": false, "name": "embedding_input"}}, {"class_name": "Embedding", "config": {"name": "embedding", "trainable": false, "batch_input_shape": [null, 550], "dtype": "float32", "input_dim": 95605, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 550}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 300, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 150, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_1", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}}]}}}, "weightsManifest": [{"paths": ["group1-shard1of29.bin", "group1-shard2of29.bin", "group1-shard3of29.bin", "group1-shard4of29.bin", "group1-shard5of29.bin", "group1-shard6of29.bin", "group1-shard7of29.bin", "group1-shard8of29.bin", "group1-shard9of29.bin", "group1-shard10of29.bin", "group1-shard11of29.bin", "group1-shard12of29.bin", "group1-shard13of29.bin", "group1-shard14of29.bin", "group1-shard15of29.bin", "group1-shard16of29.bin", "group1-shard17of29.bin", "group1-shard18of29.bin", "group1-shard19of29.bin", "group1-shard20of29.bin", "group1-shard21of29.bin", "group1-shard22of29.bin", "group1-shard23of29.bin", "group1-shard24of29.bin", "group1-shard25of29.bin", "group1-shard26of29.bin", "group1-shard27of29.bin", "group1-shard28of29.bin", "group1-shard29of29.bin"], "weights": [{"name": "bidirectional/forward_lstm/lstm_cell_1/kernel", "shape": [300, 1200], "dtype": "float32"}, {"name": "bidirectional/forward_lstm/lstm_cell_1/recurrent_kernel", "shape": [300, 1200], "dtype": "float32"}, {"name": "bidirectional/forward_lstm/lstm_cell_1/bias", "shape": [1200], "dtype": "float32"}, {"name": "bidirectional/backward_lstm/lstm_cell_2/kernel", "shape": [300, 1200], "dtype": "float32"}, {"name": "bidirectional/backward_lstm/lstm_cell_2/recurrent_kernel", "shape": [300, 1200], "dtype": "float32"}, {"name": "bidirectional/backward_lstm/lstm_cell_2/bias", "shape": [1200], "dtype": "float32"}, {"name": "embedding/embeddings", "shape": [95605, 300], "dtype": "float32"}, {"name": "time_distributed/kernel", "shape": [600, 150], "dtype": "float32"}, {"name": "time_distributed/bias", "shape": [150], "dtype": "float32"}, {"name": "time_distributed_1/kernel", "shape": [150, 3], "dtype": "float32"}, {"name": "time_distributed_1/bias", "shape": [3], "dtype": "float32"}]}]}
